Revit 2027 API
DuctSettings.Centerline Property
 The abbreviation of the Centerline (=) string.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Centerline { get; set; }
Public Property Centerline As String
	Get
	Set
public:
property String^ Centerline {
	String^ get ();
	void set (String^ value);
}
member Centerline : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace